
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Суммы Приход
	Движения.Суммы.Записывать = Истина;
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.Суммы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаДанные.Номенклатура;
		Движение.СтатьяЗатрат = ТекСтрокаДанные.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаДанные.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
